recipes/huevos-rancheros.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Huevos Rancheros</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="james" />
<link rel="stylesheet" type="text/css" href="../static/recipe.css" />
<link rel="icon" type="image/ico" href="../static/favicon.svg" />
</head>
<body>
<div id="org-div-home-and-up"> <a href="../index.html"> Home </a> </div> <div id="btns"><button id="copy-btn" onclick="copyTicked()"></button> <button id="untick-btn" onclick="untickAll()"></button></div><div id="notify">Copied!</div><div id="content">
<h1 class="title">Huevos Rancheros</h1>

<div id="outline-container-org61c5b42" class="outline-2">
<h2 id="org61c5b42">Ingredients</h2>
<div class="outline-text-2" id="text-org61c5b42">
</div>
<div id="outline-container-org4c8b81d" class="outline-3">
<h3 id="org4c8b81d">Salsa</h3>
<div class="outline-text-3" id="text-org4c8b81d">
<ul class="org-ul">
<li>Can of tomatoes (chopped)</li>
<li>Hot sauce</li>
<li>Red onion</li>
<li>Jalepeno</li>
<li>Corn (optional)</li>
<li>Cumin</li>
<li>Paprika</li>
<li>Salt &amp; Pepper</li>
</ul>
</div>
</div>

<div id="outline-container-org3a942e1" class="outline-3">
<h3 id="org3a942e1">Tofu scramble</h3>
<div class="outline-text-3" id="text-org3a942e1">
<ul class="org-ul">
<li>Tofu (firm)</li>
<li>Black salt</li>
<li>Turmeric</li>
<li>Salt &amp; Pepper</li>
</ul>
</div>
</div>

<div id="outline-container-org22aa0d1" class="outline-3">
<h3 id="org22aa0d1">Other</h3>
<div class="outline-text-3" id="text-org22aa0d1">
<ul class="org-ul">
<li>Small tortillas</li>
<li>Avocado</li>
<li>Fresh lime</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org04b35e5" class="outline-2">
<h2 id="org04b35e5">Instructions</h2>
<div class="outline-text-2" id="text-org04b35e5">
<ol class="org-ol">
<li>Turn oven to 200&deg;C</li>
<li>Cook onion and jalapeno in saucepan until brown</li>
<li>Add other salsa ingredients and bring to boil</li>
<li>Cook crumbled tofu with spices</li>
<li>Place mound of salsa onto tortilla and then top with tofu scramble</li>
<li>Cook in oven for 15 minutes or until tortilla is crisp</li>
<li>Serve with avocado and fresh squeeze of lime juice</li>
</ol>
</div>
</div>
</div>
</body>
</html>
